load-test.yml
config:
  target: "http://15.222.239.237:3000/"
  phases:
    - duration: 30
      arrivalRate: 2000

  defaults:
    headers:
      Content-Type: "application/json"
  plugins:
    metrics-by-endpoint: {} # Optional: if you want endpoint-specific metrics
  reports:
    json:
      file: "artillery_log.json"
scenarios:
  - flow:
      - get:
          url: "/"